---
kind: method
id: M:Autodesk.Revit.DB.NurbSpline.Create(Autodesk.Revit.DB.HermiteSpline)
zh: 创建、新建、生成、建立、新增
source: html/63ae2cbb-72eb-0e56-2d04-c7edb82a43cd.htm
---
# Autodesk.Revit.DB.NurbSpline.Create Method

**中文**: 创建、新建、生成、建立、新增

Creates a new geometric NurbSpline object from a HermiteSpline.

## Syntax (C#)
```csharp
public static NurbSpline Create(
	HermiteSpline hermiteSpline
)
```

## Parameters
- **hermiteSpline** (`Autodesk.Revit.DB.HermiteSpline`) - The hermite spline that will be converted to NurbSpline.

## Returns
The new NurbSpline object.